clc
clear all

a=input('Введите а');
b=input('Введите b');
n=2;   %колво узлов
N=100;% просто область определения
dx=(b-a)/(N-1);

for i=1:N
    X(i)=a+(i-1)*dx;
end
disp(X)

for i=1:N
    Y(i)=sin(X(i));
end
disp(Y)
%------------------------------------------
%работаем с полиномом лежандра
syms x
y=(x^2-1)^n
Pn=((1/2^n)/factorial(n))*diff(y,n)  %степень полинома в зависимости от колва узлов
kef=sym2poly(Pn)
PRn=diff(Pn)
nuls=roots(kef)%нули полинома
%находим кефы весовые
for i=1:n
    Ck(i)=2/((1-nuls(i)^2)*(subs(PRn,x,nuls(i)))^2)
end
%----------------------------------------------------

Xnew=((a+b)/2)+((b-a)/2)*nuls;%новые узлы в зависимости от нулей полинома
disp(Xnew)
Ynew=sin(Xnew);%новые значение функции исходной в новых узлах
disp(Ynew)
%-----------------------------------------------------
for i=1:n
    I(i)=Ck(i)*Ynew(i);
end
INT=((b-a)/2)*sum(I)

    
    
    
    
    
    